app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all.reverse

INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @email = Email.new(object: Faker::Lorem.sentence, body: Faker::Lorem.paragraph(100), read: 'false')

      if @email.save # essaie de sauvegarder en base @email

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 160], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-05-23 21:18:28.374119"], ["id", 159]]
---
def show
    @email = Email.find(params[:id])
    @email.update(read: true)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 164], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 164]]
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 155], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-05-23 21:31:46.212139"], ["id", 155]]
---
  def update
    @email = Email.find(params[:id])
    @email.read ? @email.update(read: false) : @email.update(read: true)