app/views/emails/create.js.erb


document.getElementById("email_list").insertAdjacentHTML("afterBegin", "<%= j render 'email', email: @email %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Aut nihil error pariatur."], ["body", "Suasoria sit varius. Color concido acsi."], ["created_at", "2019-05-23 11:04:28.086603"], ["updated_at", "2019-05-23 11:04:28.086603"]]